benchmark/results/run-20260429-220801/microservices-u50-concurrent-read-run2-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: C:\Users\Quan Hoang\Downloads\DuAnCntt\benchmark\k6\test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 50 VUs  0m01.0s/2m0s

running (0m02.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m02.0s/2m0s

running (0m03.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m03.0s/2m0s

running (0m04.0s), 50/50 VUs, 144 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m04.0s/2m0s

running (0m05.0s), 50/50 VUs, 186 complete and 0 interrupted iterations
default   [   4% ] 50 VUs  0m05.0s/2m0s

running (0m06.0s), 50/50 VUs, 232 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m06.0s/2m0s

running (0m07.0s), 50/50 VUs, 275 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  0m07.0s/2m0s

running (0m08.0s), 50/50 VUs, 320 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m08.0s/2m0s

running (0m09.0s), 50/50 VUs, 364 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m09.0s/2m0s

running (0m10.0s), 50/50 VUs, 405 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m10.0s/2m0s

running (0m11.0s), 50/50 VUs, 451 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  0m11.0s/2m0s

running (0m12.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m12.0s/2m0s

running (0m13.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  11% ] 50 VUs  0m13.0s/2m0s

running (0m14.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m14.0s/2m0s

running (0m15.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m15.0s/2m0s

running (0m16.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m16.0s/2m0s

running (0m17.0s), 50/50 VUs, 745 complete and 0 interrupted iterations
default   [  14% ] 50 VUs  0m17.0s/2m0s

running (0m18.0s), 50/50 VUs, 791 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m18.0s/2m0s

running (0m19.0s), 50/50 VUs, 837 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  0m19.0s/2m0s

running (0m20.0s), 50/50 VUs, 879 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m20.0s/2m0s

running (0m21.0s), 50/50 VUs, 924 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m21.0s/2m0s

running (0m22.0s), 50/50 VUs, 967 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m22.0s/2m0s

running (0m23.0s), 50/50 VUs, 1013 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  0m23.0s/2m0s

running (0m24.0s), 50/50 VUs, 1059 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m24.0s/2m0s

running (0m25.0s), 50/50 VUs, 1101 complete and 0 interrupted iterations
default   [  21% ] 50 VUs  0m25.0s/2m0s

running (0m26.0s), 50/50 VUs, 1150 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m26.0s/2m0s

running (0m27.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m27.0s/2m0s

running (0m28.0s), 50/50 VUs, 1250 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  0m28.0s/2m0s

running (0m29.0s), 50/50 VUs, 1300 complete and 0 interrupted iterations
default   [  24% ] 50 VUs  0m29.0s/2m0s

running (0m30.0s), 50/50 VUs, 1350 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  0m30.0s/2m0s

running (0m31.0s), 50/50 VUs, 1395 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  0m31.0s/2m0s

running (0m32.0s), 50/50 VUs, 1441 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m32.0s/2m0s

running (0m33.0s), 50/50 VUs, 1487 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m33.0s/2m0s

running (0m34.0s), 50/50 VUs, 1533 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  0m34.0s/2m0s

running (0m35.0s), 50/50 VUs, 1576 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  0m35.0s/2m0s

running (0m36.0s), 50/50 VUs, 1621 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  0m36.0s/2m0s

running (0m37.0s), 50/50 VUs, 1667 complete and 0 interrupted iterations
default   [  31% ] 50 VUs  0m37.0s/2m0s

running (0m38.0s), 50/50 VUs, 1713 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m38.0s/2m0s

running (0m39.0s), 50/50 VUs, 1756 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m39.0s/2m0s

running (0m40.0s), 50/50 VUs, 1801 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  0m40.0s/2m0s

running (0m41.0s), 50/50 VUs, 1851 complete and 0 interrupted iterations
default   [  34% ] 50 VUs  0m41.0s/2m0s

running (0m42.0s), 50/50 VUs, 1900 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  0m42.0s/2m0s

running (0m43.0s), 50/50 VUs, 1950 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  0m43.0s/2m0s

running (0m44.0s), 50/50 VUs, 2000 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m44.0s/2m0s

running (0m45.0s), 50/50 VUs, 2050 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m45.0s/2m0s

running (0m46.0s), 50/50 VUs, 2096 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  0m46.0s/2m0s

running (0m47.0s), 50/50 VUs, 2139 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  0m47.0s/2m0s

running (0m48.0s), 50/50 VUs, 2185 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  0m48.0s/2m0s

running (0m49.0s), 50/50 VUs, 2230 complete and 0 interrupted iterations
default   [  41% ] 50 VUs  0m49.0s/2m0s

running (0m50.0s), 50/50 VUs, 2273 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m50.0s/2m0s

running (0m51.0s), 50/50 VUs, 2318 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m51.0s/2m0s

running (0m52.0s), 50/50 VUs, 2360 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  0m52.0s/2m0s

running (0m53.0s), 50/50 VUs, 2406 complete and 0 interrupted iterations
default   [  44% ] 50 VUs  0m53.0s/2m0s

running (0m54.0s), 50/50 VUs, 2453 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  0m54.0s/2m0s

running (0m55.0s), 50/50 VUs, 2502 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  0m55.0s/2m0s

running (0m56.0s), 50/50 VUs, 2551 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m56.0s/2m0s

running (0m57.0s), 50/50 VUs, 2601 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m57.0s/2m0s

running (0m58.0s), 50/50 VUs, 2650 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  0m58.0s/2m0s

running (0m59.0s), 50/50 VUs, 2697 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  0m59.0s/2m0s

running (1m00.0s), 50/50 VUs, 2739 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  1m00.0s/2m0s

running (1m01.0s), 50/50 VUs, 2785 complete and 0 interrupted iterations
default   [  51% ] 50 VUs  1m01.0s/2m0s

running (1m02.0s), 50/50 VUs, 2831 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  1m02.0s/2m0s

running (1m03.0s), 50/50 VUs, 2877 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  1m03.0s/2m0s

running (1m04.0s), 50/50 VUs, 2923 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  1m04.0s/2m0s

running (1m05.0s), 50/50 VUs, 2969 complete and 0 interrupted iterations
default   [  54% ] 50 VUs  1m05.0s/2m0s

running (1m06.0s), 50/50 VUs, 3014 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  1m06.0s/2m0s

running (1m07.0s), 50/50 VUs, 3060 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  1m07.0s/2m0s

running (1m08.0s), 50/50 VUs, 3106 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  1m08.0s/2m0s

running (1m09.0s), 50/50 VUs, 3152 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  1m09.0s/2m0s

running (1m10.0s), 50/50 VUs, 3202 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  1m10.0s/2m0s

running (1m11.0s), 50/50 VUs, 3252 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  1m11.0s/2m0s

running (1m12.0s), 50/50 VUs, 3300 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  1m12.0s/2m0s

running (1m13.0s), 50/50 VUs, 3348 complete and 0 interrupted iterations
default   [  61% ] 50 VUs  1m13.0s/2m0s

running (1m14.0s), 50/50 VUs, 3394 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  1m14.0s/2m0s

running (1m15.0s), 50/50 VUs, 3440 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  1m15.0s/2m0s

running (1m16.0s), 50/50 VUs, 3484 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  1m16.0s/2m0s

running (1m17.0s), 50/50 VUs, 3530 complete and 0 interrupted iterations
default   [  64% ] 50 VUs  1m17.0s/2m0s

running (1m18.0s), 50/50 VUs, 3576 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  1m18.0s/2m0s

running (1m19.0s), 50/50 VUs, 3618 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  1m19.0s/2m0s

running (1m20.0s), 50/50 VUs, 3664 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  1m20.0s/2m0s

running (1m21.0s), 50/50 VUs, 3710 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  1m21.0s/2m0s

running (1m22.0s), 50/50 VUs, 3752 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  1m22.0s/2m0s

running (1m23.0s), 50/50 VUs, 3802 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  1m23.0s/2m0s

running (1m24.0s), 50/50 VUs, 3852 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  1m24.0s/2m0s

running (1m25.0s), 50/50 VUs, 3902 complete and 0 interrupted iterations
default   [  71% ] 50 VUs  1m25.0s/2m0s

running (1m26.0s), 50/50 VUs, 3952 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  1m26.0s/2m0s

running (1m27.0s), 50/50 VUs, 4002 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  1m27.0s/2m0s

running (1m28.0s), 50/50 VUs, 4046 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  1m28.0s/2m0s

running (1m29.0s), 50/50 VUs, 4092 complete and 0 interrupted iterations
default   [  74% ] 50 VUs  1m29.0s/2m0s

running (1m30.0s), 50/50 VUs, 4134 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  1m30.0s/2m0s

running (1m31.0s), 50/50 VUs, 4177 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  1m31.0s/2m0s

running (1m32.0s), 50/50 VUs, 4226 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  1m32.0s/2m0s

running (1m33.0s), 50/50 VUs, 4272 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  1m33.0s/2m0s

running (1m34.0s), 50/50 VUs, 4318 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  1m34.0s/2m0s

running (1m35.0s), 50/50 VUs, 4360 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  1m35.0s/2m0s

running (1m36.0s), 50/50 VUs, 4405 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  1m36.0s/2m0s

running (1m37.0s), 50/50 VUs, 4452 complete and 0 interrupted iterations
default   [  81% ] 50 VUs  1m37.0s/2m0s

running (1m38.0s), 50/50 VUs, 4502 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  1m38.0s/2m0s

running (1m39.0s), 50/50 VUs, 4552 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  1m39.0s/2m0s

running (1m40.0s), 50/50 VUs, 4600 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  1m40.0s/2m0s

running (1m41.0s), 50/50 VUs, 4646 complete and 0 interrupted iterations
default   [  84% ] 50 VUs  1m41.0s/2m0s

running (1m42.0s), 50/50 VUs, 4692 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  1m42.0s/2m0s

running (1m43.0s), 50/50 VUs, 4738 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  1m43.0s/2m0s

running (1m44.0s), 50/50 VUs, 4784 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  1m44.0s/2m0s

running (1m45.0s), 50/50 VUs, 4830 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  1m45.0s/2m0s

running (1m46.0s), 50/50 VUs, 4872 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  1m46.0s/2m0s

running (1m47.0s), 50/50 VUs, 4918 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  1m47.0s/2m0s

running (1m48.0s), 50/50 VUs, 4960 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  1m48.0s/2m0s

running (1m49.0s), 50/50 VUs, 5006 complete and 0 interrupted iterations
default   [  91% ] 50 VUs  1m49.0s/2m0s

running (1m50.0s), 50/50 VUs, 5052 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  1m50.0s/2m0s

running (1m51.0s), 50/50 VUs, 5102 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  1m51.0s/2m0s

running (1m52.0s), 50/50 VUs, 5152 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  1m52.0s/2m0s

running (1m53.0s), 50/50 VUs, 5202 complete and 0 interrupted iterations
default   [  94% ] 50 VUs  1m53.0s/2m0s

running (1m54.0s), 50/50 VUs, 5252 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  1m54.0s/2m0s

running (1m55.0s), 50/50 VUs, 5297 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  1m55.0s/2m0s

running (1m56.0s), 50/50 VUs, 5342 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  1m56.0s/2m0s

running (1m57.0s), 50/50 VUs, 5388 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  1m57.0s/2m0s

running (1m58.0s), 50/50 VUs, 5430 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  1m58.0s/2m0s

running (1m59.0s), 50/50 VUs, 5476 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  1m59.0s/2m0s

running (2m00.0s), 50/50 VUs, 5519 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  2m00.0s/2m0s

running (2m01.0s), 05/50 VUs, 5564 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  2m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=20.17ms med=7.06ms min=504.29µs max=725.97ms p(90)=57.76ms p(95)=63.85ms p(99)=92.05ms
      { expected_response:true }...: avg=20.17ms med=7.06ms min=504.29µs max=725.97ms p(90)=57.76ms p(95)=63.85ms p(99)=92.05ms
    http_req_failed................: 0.00%  0 out of 22276
    http_reqs......................: 22276  184.013132/s

    EXECUTION
    iteration_duration.............: avg=1.08s   med=1.07s  min=1.06s    max=1.74s    p(90)=1.09s   p(95)=1.1s    p(99)=1.24s  
    iterations.....................: 5569   46.003283/s
    vus............................: 5      min=5          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 47 MB  387 kB/s
    data_sent......................: 8.1 MB 67 kB/s



running (2m01.1s), 00/50 VUs, 5569 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  2m0s